{"format": "graph-model", "generatedBy": "1.13.1", "convertedBy": "TensorFlow.js Converter v1.2.3", "modelTopology": {"node": [{"name": "X_features", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Accuracy_Calculation/final_prediction/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "OutputLayer/Wght", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "HiddenLayer2/Wght", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "HiddenLayer1/Wght", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "HiddenLayer1/Bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "HiddenLayer2/Bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "OutputLayer/Bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "HiddenLayer1/MatMul", "op": "MatMul", "input": ["X_features", "HiddenLayer1/Wght"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "HiddenLayer1/add", "op": "Add", "input": ["HiddenLayer1/Bias", "HiddenLayer1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "HiddenLayer1/Relu", "op": "Relu", "input": ["HiddenLayer1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "HiddenLayer2/MatMul", "op": "MatMul", "input": ["HiddenLayer1/Relu", "HiddenLayer2/Wght"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "HiddenLayer2/add", "op": "Add", "input": ["HiddenLayer2/Bias", "HiddenLayer2/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "HiddenLayer2/Relu", "op": "Relu", "input": ["HiddenLayer2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "OutputLayer/MatMul", "op": "MatMul", "input": ["HiddenLayer2/Relu", "OutputLayer/Wght"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "OutputLayer/add", "op": "Add", "input": ["OutputLayer/Bias", "OutputLayer/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "OutputLayer/Softmax", "op": "Softmax", "input": ["OutputLayer/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Accuracy_Calculation/final_prediction", "op": "ArgMax", "input": ["OutputLayer/Softmax", "Accuracy_Calculation/final_prediction/dimension"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}}}], "library": {}, "versions": {"producer": 38}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Accuracy_Calculation/final_prediction/dimension", "shape": [], "dtype": "int32"}, {"name": "OutputLayer/Wght", "shape": [64, 10], "dtype": "float32"}, {"name": "HiddenLayer2/Wght", "shape": [512, 64], "dtype": "float32"}, {"name": "HiddenLayer1/Wght", "shape": [784, 512], "dtype": "float32"}, {"name": "HiddenLayer1/Bias", "shape": [512], "dtype": "float32"}, {"name": "HiddenLayer2/Bias", "shape": [64], "dtype": "float32"}, {"name": "OutputLayer/Bias", "shape": [10], "dtype": "float32"}]}]}